app/controllers/meals_controller.rb

SELECT * FROM "meals" ORDER BY time
---
  def index
    @meals = Meal.all(:order => "time")

SELECT * FROM "meals" WHERE ("meals"."id" = 5)
---
  def edit
    @meal = Meal.find(params[:id])

INSERT INTO "meals" ("name", "location", "created_at", "comments", "updated_at", "time", "uid", "havedba", "email") VALUES(NULL, 'Hop', '2011-06-02 22:01:12', '', '2011-06-02 22:01:12', NULL, 931605795, '1', 'JulianO.B.Bangert@DARTMOUTH.EDU')
---
  def create
    @meal = Meal.new(params[:meal])
    @meal.name = @name
    @meal.email = @email
    @meal.uid = @uid
    respond_to do |format|
      if @meal.save

SELECT * FROM "meals" WHERE ("meals"."id" = 6 AND (uid='931605795'))
---
  def update
    @meal = Meal.find(params[:id],:conditions => ["uid=?",@uid])

SELECT * FROM "meals" WHERE ("meals"."id" = 4 AND (uid=931605795))
DELETE FROM "meals" WHERE "id" = 1
---
  def destroy
    @meal = Meal.find(params[:id],:conditions => ["uid=?",@uid])
    @meal.destroy